let tasksHeaderColumns = $(".tasks_header div:not(.arrows)"),
    taskTableSizing = 4;

itemsArr = [
  ["", "96752", "Тест 01-02-34", "0.Формирование предложения", "2024-02-03", "ABC Реклама", "Текущий статус: формирование предложения", "", "", "", "1Q-2", "2024"],
  ["", "96771", "Тест 02-02-24", "0.Формирование преложения", "2024-02-02", "АБС", "Текущий статус: формирование предложения", "", "", "", "1Q-2", "2024"],
  ["", "95732", "тестовая задача 3", "0.Формирование предложения", "2024-01-18", "Гамма Логистик", "Текущий статус: формирование предложения", "", "", "", "1Q-1", "2024"],
  ["", "95731", "Тестовая задача по поставкам", "0.Формирование предложения", "2024-01-18", "Гамма Логистик", "Текущий статус: формирование предложения", "", "", "", "1Q-1", "2024"],
  /*
    ["95733", "тестовая задача 1", "0.Формирование предложения", "2022-01-19", "Гамма Логистик", "Текущий статус: формирование предложения", "", "", "", "1Q-2", "2022"],
    ["95221", "тестовая задача 2", "0.Формирование предложения", "2023-01-20", "АБС", "Текущий статус: формирование предложения", "", "", "", "1Q-3", "2023"],
    ["95724", "тестовая задача 4", "0.Формирование предложения", "2024-01-21", "АБС", "Текущий статус: Формирование предложения", "", "", "", "1Q-4", "2024"] */
];

function addEvent() {
  
}

addEvent();
renderTable(itemsArr);